БухЭксп/Catalogs/CW_ВебШаблоныПрофилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебШаблоныПрофилей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Comment>ЗАЯВКИ / ГРУЗОПЕРЕВОЗКИ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПрофиля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаголовокEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектХарактеристики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БыстрыйОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенФормат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВариантыФиксацииКолонок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеТипаЗначения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляСортировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сортировка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокСортировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяГруппыRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяГруппыEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеШрифт</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЦветФона</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЦветТекста</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьОформление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьЗаголовок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантыФиксацииКолонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантыФиксацииКолонок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Право</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокСортировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокСортировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВозрастанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУбыванию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Заявки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПеревозок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебШаблоныПрофилей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Наименование	= "Новый";
	КонецЕсли;     
	
	УстановитьПараметрыОформленияПоУмолчанию();
	
	СтарыйРаздел = Объект.Раздел;
	
	Если Не ПустаяСтрока(Объект.Раздел) Тогда
		УстановитьАдресаСхемыДоступныхПолей(Объект.Раздел);              
	КонецЕсли;  
	
	Если Параметры.Ключ.Пустая() Тогда
		ДобавитьГруппуСПустымИдентификатором();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьЗначенияДополительныхКолонок(ТекущийОбъект);
	
КонецПроцедуры   

&НаСервере
Процедура ОбновитьКоличествоПолейГруппНаСервере()
	
	Для Каждого СтрокаГруппы из Объект.ГруппыПолей Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторГруппы", СтрокаГруппы.ИдентификаторГруппы); 
		
		МассивПолей = Объект.ПоляОбъекта.НайтиСтроки(Отбор);
		СтрокаГруппы.КоличествоПолей =  МассивПолей.Количество();
	КонецЦикла;
	
КонецПроцедуры


 &НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьЗначенияДополительныхКолонок(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияДополительныхКолонок(ТекущийОбъект)
   
	Для Каждого СтрокаТекущийОбъект из ТекущийОбъект.СтруктураПрофиля Цикл
		ИндексСтроки = ТекущийОбъект.СтруктураПрофиля.Индекс(СтрокаТекущийОбъект);	
		
		СтрокаОбъект = Объект.СтруктураПрофиля[ИндексСтроки];  
		СтрокаОбъект.ОписаниеТипа = СтрокаТекущийОбъект.ХранилищеТипаЗначения.Получить();
	КонецЦикла; 
	
	Для Каждого СтрокаТаблицы из ТекущийОбъект.ГруппыПолей Цикл   
		ИндексСтроки	= ТекущийОбъект.ГруппыПолей.Индекс(СтрокаТаблицы);  
		
		СтрокаОбъекта 	= Объект.ГруппыПолей[ИндексСтроки]; 
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторГруппы", СтрокаОбъекта.ИдентификаторГруппы); 
		МассивПолей = Объект.ПоляОбъекта.НайтиСтроки(Отбор);
	
		
		СтрокаОбъекта.Шрифт 			= СтрокаТаблицы.ХранилищеШрифт.Получить();   
		СтрокаОбъекта.ЦветФона 			= СтрокаТаблицы.ХранилищеЦветФона.Получить();   
		СтрокаОбъекта.ЦветТекста 		= СтрокаТаблицы.ХранилищеЦветТекста.Получить();   
		СтрокаОбъекта.ИндексКартинки 	= ?(ЗначениеЗаполнено(СтрокаОбъекта.ИдентификаторГруппы), 0, 2);  
		СтрокаОбъекта.КоличествоПолей 	=  МассивПолей.Количество();
		
	КонецЦикла; 
	
	Для Каждого СтрокаТаблицы из ТекущийОбъект.ПоляОбъекта Цикл   
		ИндексСтроки	= ТекущийОбъект.ПоляОбъекта.Индекс(СтрокаТаблицы);  
		
		СтрокаОбъекта 	= Объект.ПоляОбъекта[ИндексСтроки];  
		СтрокаОбъекта.ИндексКартинки 	= 3;
	КонецЦикла; 

   
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаСтруктуры из Объект.СтруктураПрофиля Цикл
		ИндексСтроки = Объект.СтруктураПрофиля.Индекс(СтрокаСтруктуры);	
		СтрокаТекущийОбъект = ТекущийОбъект.СтруктураПрофиля[ИндексСтроки];  
		СтрокаТекущийОбъект.ХранилищеТипаЗначения = Новый ХранилищеЗначения(СтрокаСтруктуры.ОписаниеТипа);
	КонецЦикла;   
	
	Для Каждого СтрокаТаблицы из ТекущийОбъект.ГруппыПолей Цикл  
		ИндексСтроки	= ТекущийОбъект.ГруппыПолей.Индекс(СтрокаТаблицы);
		СтрокаОбъекта 	= Объект.ГруппыПолей[ИндексСтроки];  
		
		СтрокаТаблицы.ХранилищеШрифт 		= Новый ХранилищеЗначения(СтрокаОбъекта.Шрифт);
		СтрокаТаблицы.ХранилищеЦветФона 	= Новый ХранилищеЗначения(СтрокаОбъекта.ЦветФона);
		СтрокаТаблицы.ХранилищеЦветТекста 	= Новый ХранилищеЗначения(СтрокаОбъекта.ЦветТекста);   
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДобавитьГруппуСПустымИдентификатором(); 

КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиНового(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделПриИзменении(Элемент) 
	
	Если СтарыйРаздел = Объект.Раздел Тогда
		//Ничего делать не нужно
		Возврат;
	КонецЕсли;  

	Оповещение = Новый ОписаниеОповещения("ЗавершитьИзменениеРаздела", ЭтотОбъект);
	
	Если Объект.СтруктураПрофиля.Количество() <> 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Структура профиля будет очищена. Продолжить?", Режим, 0);	
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение,КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьИзменениеРаздела(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда     
		Объект.Раздел = СтарыйРаздел;
        Возврат;
    КонецЕсли;
	
	Объект.СтруктураПрофиля.Очистить();
	Объект.ПоляСортировки.Очистить();
	
	УстановитьАдресаСхемыДоступныхПолей(Объект.Раздел);

	СтарыйРаздел = Объект.Раздел;

КонецПроцедуры

&НаСервере
Процедура УстановитьАдресаСхемыДоступныхПолей(Знач Раздел) 
	
	Если ПустаяСтрока(Раздел) Тогда 
		АдресСхемыДоступныхПолей = "";
		Возврат;
	КонецЕсли;
		
	СхемаДоступныхПолей  		= ПолучитьОбщийМакет("CW_"+Раздел+"СхемаДоступныхПолей");
	АдресСхемыДоступныхПолей 	= ПоместитьВоВременноеХранилище(СхемаДоступныхПолей,Этаформа.УникальныйИдентификатор);
	
КонецПроцедуры 

&НаКлиенте
Процедура СтруктураПрофиляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда
		СтандартнаяОбработка = ложь;	
		
		ТекущаяСтрока = Элементы.СтруктураПрофиля.ТекущаяСтрока;
		ТекущиеДанные = Элементы.СтруктураПрофиля.ТекущиеДанные;
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("СтрокаПоляКомпоновки", ТекущиеДанные.СтрокаПоляКомпоновки);
		ДанныеСтроки.Вставить("ОбъектХарактеристики", ТекущиеДанные.ОбъектХарактеристики);
		
		Конструктор = Новый КонструкторФорматнойСтроки;
		Конструктор.Текст 			= Элементы.СтруктураПрофиля.ТекущиеДанные.Формат;
		Конструктор.ДоступныеТипы 	= ПолучитьОписаниеТипаНаСервере(ДанныеСтроки); 
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияФорматаКолонки", ЭтотОбъект, ДополнительныеПараметры); 
		Конструктор.Показать(ОписаниеОповещения);

	КонецЕсли;
	
КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПолучитьОписаниеТипаНаСервере(ДанныеСтроки)

	Если ЗначениеЗаполнено(ДанныеСтроки.ОбъектХарактеристики) Тогда
		Возврат ДанныеСтроки.ОбъектХарактеристики.ТипЗначения;
	Конецесли;
	
	Ссылка 				= ПредопределенноеЗначение("Справочник.CW_Заявки.ПустаяСсылка");
	ЛогистическийСтатус = ПредопределенноеЗначение("Справочник.CW_ЛогистическиеСтатусы.ПустаяСсылка");
	ПустоеЗначение 		= Вычислить(ДанныеСтроки.СтрокаПоляКомпоновки); 
	
	ДоступныйТип = Новый Массив;
	ДоступныйТип.Добавить(ТипЗнч(ПустоеЗначение));
	
	Возврат Новый ОписаниеТипов(ДоступныйТип);	
	
КонецФункции


&НаКлиенте
Процедура ОбработкаИзмененияФорматаКолонки(ФорматЗначения, ДополнительныеПараметры) Экспорт 
	
	Если ФорматЗначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТекущая = Объект.СтруктураПрофиля.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	СтрокаТекущая.Формат = ФорматЗначения; 
	
КонецПроцедуры


&НаКлиенте
Процедура СтруктураПрофиляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;	
	
	Если Не ЭтоАдресВременногоХранилища(АдресСхемыДоступныхПолей) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран раздел шаблона!",,"Раздел", "Объект");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбработкаДобавленияКолонки",ЭтотОбъект); 
	СтруктураПараметров = Новый Структура("АдресСхемыКомпоновки", АдресСхемыДоступныхПолей);
	
	ОткрытьФорму("Справочник.CW_ВебШаблоныПрофилей.Форма.ФормаПодбораКолонки",СтруктураПараметров,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияКолонки(ВыбранныеПоля, ДополнительныеПараметры) Экспорт  
	
	Если ВыбранныеПоля = Неопределено Тогда
		Возврат;
	КонецЕсли;                                                                
	
	ОбработатьВыборПоляНаСервере(ВыбранныеПоля);
	
	Модифицированность = Истина;

КонецПроцедуры 
	
&НаСервере
Процедура ОбработатьВыборПоляНаСервере(ВыбранныеПоля)  
	
	ПримитивныеТипы = Новый Массив;
	ПримитивныеТипы.Добавить(Тип("Булево"));
	ПримитивныеТипы.Добавить(Тип("Дата"));
	ПримитивныеТипы.Добавить(Тип("Число"));
	
	Для Каждого ВыбранноеПоле из ВыбранныеПоля Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("СтрокаПоляКомпоновки", Строка(ВыбранноеПоле.Поле));
		
		мСтроки = Объект.СтруктураПрофиля.НайтиСтроки(Отбор);
		Если мСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;      
		
		СтрокаТаблицы = Объект.СтруктураПрофиля.Добавить(); 
		СтрокаТаблицы.ИмяПоля				= ИмяПоляИзСтрокиПоляКомпоновки(Строка(ВыбранноеПоле.Поле));
		СтрокаТаблицы.СтрокаПоляКомпоновки	= Строка(ВыбранноеПоле.Поле);
		СтрокаТаблицы.ЗаголовокRU			= ВыбранноеПоле.Заголовок;
		
		МассивТипов = ВыбранноеПоле.ТипЗначения.Типы();
		Для Каждого ТипЗначения из МассивТипов Цикл   
			Если ПримитивныеТипы.Найти(ТипЗначения) <> Неопределено Тогда 
				СтрокаТаблицы.ДоступенФормат = Истина; 
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		СтрокаТаблицы.ОписаниеТипа 			= ВыбранноеПоле.ТипЗначения;
		СтрокаТаблицы.Фиксация 				= ПредопределенноеЗначение("Перечисление.CW_ВариантыФиксацииКолонок.Нет");
		СтрокаТаблицы.ОбъектХарактеристики 	= ПолучитьМониторинговыйПараметр(Строка(ВыбранноеПоле.Поле));
		
		//Поля объекта
		СтрокаТаблицы = Объект.ПоляОбъекта.Добавить(); 
		СтрокаТаблицы.СтрокаПоляКомпоновки	= Строка(ВыбранноеПоле.Поле);
		СтрокаТаблицы.ЗаголовокRU			= ВыбранноеПоле.Заголовок;
		СтрокаТаблицы.ИндексКартинки 		= 3;
		
	КонецЦикла; 
	
КонецПроцедуры   

&НаКлиенте
Процедура СтруктураПрофиляПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.СтруктураПрофиля.ТекущиеДанные;
	
	Отбор = Новый Структура("СтрокаПоляКомпоновки", ТекущиеДанные.СтрокаПоляКомпоновки);
	
	МассивПоляОбъекта = Объект.ПоляОбъекта.НайтиСтроки(Отбор);
	Для Каждого СтрокаМассива из МассивПоляОбъекта Цикл
		Объект.ПоляОбъекта.Удалить(СтрокаМассива);	
	КонецЦикла;
	
	МассивПоляСортировки = Объект.ПоляСортировки.НайтиСтроки(Отбор);
	Для Каждого СтрокаМассива из МассивПоляСортировки Цикл
		Объект.ПоляСортировки.Удалить(СтрокаМассива);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПрофиляЗаголовокRUПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтруктураПрофиля.ТекущиеДанные;
	
	ОбновитьЗаголовокСвязанныхПолей(ТекущиеДанные.СтрокаПоляКомпоновки, ТекущиеДанные.ЗаголовокRU);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокСвязанныхПолей(Знач СтрокаПоляКомпоновки, Знач ЗаголовокПоля)
	
	Отбор = Новый Структура("СтрокаПоляКомпоновки", СтрокаПоляКомпоновки);
	
	МассивПоляОбъекта = Объект.ПоляОбъекта.НайтиСтроки(Отбор);
	Для Каждого СтрокаМассива из МассивПоляОбъекта Цикл    
		СтрокаМассива.ЗаголовокRU = ЗаголовокПоля;
	КонецЦикла;
	
	МассивПоляСортировки = Объект.ПоляСортировки.НайтиСтроки(Отбор);
	Для Каждого СтрокаМассива из МассивПоляСортировки Цикл
		СтрокаМассива.Заголовок = ЗаголовокПоля;
	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ДобавитьГруппуСПустымИдентификатором()
	
	ПустойИдентификаторГруппы = ПустойУникальныйИдентификатор();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторГруппы", ПустойИдентификаторГруппы); 
	
	МассивПолей	= Объект.ПоляОбъекта.НайтиСтроки(Отбор);
	МассивГрупп	= Объект.ГруппыПолей.НайтиСтроки(Отбор);
	
	Если (МассивПолей.Количество() > 0 
		И МассивГрупп.Количество() = 0) 
		ИЛИ Объект.ГруппыПолей.Количество() = 0 Тогда 
		
		//Добавим группу с пустым идентификатором
		НоваяСтрока = Объект.ГруппыПолей.Вставить(0);
		НоваяСтрока.ИмяГруппыRU 			= "<Пустая>"; 
		НоваяСтрока.ИдентификаторГруппы 	= ПустойИдентификаторГруппы;  
		НоваяСтрока.ИндексКартинки			= 2;
		НоваяСтрока.ЕстьОформление			= -1;

		ВыбранныеСтроки = Новый Массив;
		ВыбранныеСтроки.Добавить(НоваяСтрока.ПолучитьИдентификатор());
		
		УстановитьОформлениеПоУмолчаниюНаСервере(ВыбранныеСтроки);   
		
		ОбновитьКоличествоПолейГруппНаСервере(); 
		
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Функция ПустойУникальныйИдентификатор()
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецФункции  

&НаСервере
Функция ИмяПоляИзСтрокиПоляКомпоновки(Знач ИмяПоля)
	
	ИмяПоля = СтрЗаменить(ИмяПоля," ","");
	ИмяПоля = СтрЗаменить(ИмяПоля,"(","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,")","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"[","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"]","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,".","");
	ИмяПоля = СтрЗаменить(ИмяПоля,",","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"/","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"\","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"!","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"@","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"#","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"№","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"$","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,";","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"%","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"^","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,":","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"&","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"?","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"*","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"-","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"+","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"=","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"~","_");
	ИмяПоля = СтрЗаменить(ИмяПоля,"|","_");
	
	Возврат НРег(ИмяПоля);
	
КонецФункции

&НаСервере
Функция ПолучитьМониторинговыйПараметр(СтрокаПоляКомпоновки) 
	
	позНачала = СтрНайти(СтрокаПоляКомпоновки,"[");
	позКонеца = СтрНайти(СтрокаПоляКомпоновки,"]"); 
	
	Идентификатор = Сред(СтрокаПоляКомпоновки, позНачала+1, позКонеца-позНачала-1);
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	(CW_ПараметрыГрузоперевозок.Идентификатор = &Идентификатор
	               |			ИЛИ CW_ПараметрыГрузоперевозок.ИдентификаторПлан = &Идентификатор
	               |			ИЛИ CW_ПараметрыГрузоперевозок.ИдентификаторФакт = &Идентификатор)"; 
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции      

&НаКлиенте
Процедура ПоказатьНазвание(Команда)

	ПоказыватьНаименование 				= НЕ ПоказыватьНаименование;  
	Элементы.ПоказатьНазвание.Пометка	= ПоказыватьНаименование;
	
	Элементы.СтруктураПрофиляСтрокаПоляКомпоновки.Видимость = ПоказыватьНаименование;

КонецПроцедуры


&НаКлиенте
Процедура ПоляСортировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	СписокДоступныхПолей = ПолучитьСписокДоступныхПолей();
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборПоляСортировки", ЭтотОбъект);
	СписокДоступныхПолей.ПоказатьВыборЭлемента(Оповещение, "Доступные поля сортировки");
	
КонецПроцедуры   


&НаКлиенте                                
Процедура ЗавершитьВыборПоляСортировки(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мСтроки = Объект.ПоляСортировки.НайтиСтроки(Новый Структура("СтрокаПоляКомпоновки",РезультатВыбора.Значение));
	Если мСтроки.Количество() > 0 Тогда
		Возврат; //уже добавлено
	КонецЕсли;
	
	ЗавершитьВыборПоляСортировкиНаСервере(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборПоляСортировкиНаСервере(РезультатВыбора)
	
	НоваяСтрока = Объект.ПоляСортировки.Добавить();
	НоваяСтрока.СтрокаПоляКомпоновки 	= РезультатВыбора.Значение;
	НоваяСтрока.Заголовок 				= РезультатВыбора.Представление;
	НоваяСтрока.Сортировка 				= ПредопределенноеЗначение("Перечисление.CW_ПорядокСортировки.ПоВозрастанию");

КонецПроцедуры


&НаСервере
Функция ПолучитьСписокДоступныхПолей()
	
	СписокЗначений = новый СписокЗначений;
	
	Для Каждого СтрокаПоля из Объект.СтруктураПрофиля Цикл
		СписокЗначений.Добавить(СтрокаПоля.СтрокаПоляКомпоновки, СтрокаПоля.ЗаголовокRU);
	КонецЦикла;  
	
	Возврат СписокЗначений;
	
КонецФункции

&НаКлиенте
Процедура ГруппыПолейПередУдалением(Элемент, Отказ)

	Отказ = истина;	
	
	ТекущиеДанные = Элементы.ГруппыПолей.ТекущиеДанные; 
	Если ТекущиеДанные.ИндексКартинки = 2 Тогда
		ПоказатьПредупреждение(, "Нельзя удалять предопределенный элемент!");
		Возврат;
	КонецЕсли;   
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторГруппы", ТекущиеДанные.ИдентификаторГруппы); 
	
	ТекущаяСтрока = Элементы.ГруппыПолей.ТекущаяСтрока;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Отбор", Отбор); 
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока); 

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдаленииГруппы", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Группа будет удалена. 
	                           |Продолжить?", Режим, 0);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдаленииГруппы(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	МассивСтрокСостава 	= Объект.ПоляОбъекта.НайтиСтроки(ДополнительныеПараметры.Отбор);
	Для Каждого СтрокаМассива из МассивСтрокСостава Цикл  
		СтрокаМассива.ИдентификаторГруппы = ПустойУникальныйИдентификатор();
	КонецЦикла;  
	
	СтрокаТекущая = Объект.ГруппыПолей.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	Объект.ГруппыПолей.Удалить(СтрокаТекущая);

	ОбновитьКоличествоПолейГруппНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда 
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.ГруппыПолей.ТекущиеДанные;
		ТекущаяСтрока = Элементы.ГруппыПолей.ТекущаяСтрока;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторГруппы) Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
        СтруктураПараметров.Вставить("Шрифт", 				ТекущиеДанные.Шрифт);
        СтруктураПараметров.Вставить("ЦветТекста", 			ТекущиеДанные.ЦветТекста);
        СтруктураПараметров.Вставить("ЦветФона", 			ТекущиеДанные.ЦветФона);
        СтруктураПараметров.Вставить("ОтображатьЗаголовок",	ТекущиеДанные.ОтображатьЗаголовок);
		
		ВыделенныеСтроки = Новый Массив;
		ВыделенныеСтроки.Добавить(ТекущаяСтрока);
		
		ОткрытьФормуНастройкиОформления(СтруктураПараметров, ВыделенныеСтроки);
		                              
	КонецЕсли;

КонецПроцедуры  

 &НаКлиенте
Процедура ГруппыПолейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Копирование Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	ДобавитьГруппуСПустымИдентификатором();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПолейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ГруппыПолей.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторГруппы = Новый УникальныйИдентификатор();
		ТекущиеДанные.КоличествоПолей	  = 0;
		
		ТекущаяСтрока = Элементы.ГруппыПолей.ТекущаяСтрока; 
		
		ВыбранныеСтроки = Новый Массив;
		ВыбранныеСтроки.Добавить(ТекущаяСтрока);
		УстановитьОформлениеПоУмолчаниюНаСервере(ВыбранныеСтроки);   
		
		УстановитьОтборСтрок(ТекущиеДанные.ИдентификаторГруппы);

		ОбновитьКоличествоПолейГруппНаСервере();
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ГруппыПолейПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) 
	
	СтандартнаяОбработка = ЛожЬ;
	
	СтрокаГруппы = Объект.ГруппыПолей.НайтиПоИдентификатору(Строка); 
	
	Для Каждого СтрокаПоля из ПараметрыПеретаскивания.Значение Цикл
		СтрокаПоля.ИдентификаторГруппы = СтрокаГруппы.ИдентификаторГруппы;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ГруппыПолейПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ГруппыПолей.ТекущиеДанные;  
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСтрок(ТекущиеДанные.ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрок(Знач ИдентификаторГруппы = Неопределено)
	
	ФиксированнаяСтруктура = Неопределено;
	Если ИдентификаторГруппы <> Неопределено Тогда
		ОтборСтрок = новый Структура;
		ОтборСтрок.Вставить("ИдентификаторГруппы", ИдентификаторГруппы);  
		ФиксированнаяСтруктура = новый ФиксированнаяСтруктура(ОтборСтрок);
	Конецесли;
	
	Элементы.ПоляОбъекта.ОтборСтрок = ФиксированнаяСтруктура;
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппыПолейИмяГруппыRUНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ТекущиеДанные 	= Элементы.ГруппыПолей.ТекущиеДанные;  
	ТекущаяСтрока 	= Элементы.ГруппыПолей.ТекущаяСтрока;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("ИмяТаблицы", 		"ГруппыПолей");
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ИмяГруппы");
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("RU", ТекущиеДанные.ИмяГруппыRU);
	СтруктураПараметров.Вставить("EN", ТекущиеДанные.ИмяГруппыEN); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаврешитьВводРазноязычныхТекстов", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаТекстаНаРазныхЯзыках",СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры 

&НаКлиенте
Процедура СтруктураПрофиляЗаголовокRUНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ТекущиеДанные 	= Элементы.СтруктураПрофиля.ТекущиеДанные;  
	ТекущаяСтрока 	= Элементы.СтруктураПрофиля.ТекущаяСтрока;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("ИмяТаблицы", 		"СтруктураПрофиля");
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"Заголовок");
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("RU", ТекущиеДанные.ЗаголовокRU);
	СтруктураПараметров.Вставить("EN", ТекущиеДанные.ЗаголовокEN); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаврешитьВводРазноязычныхТекстов", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаТекстаНаРазныхЯзыках",СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры

&НаКлиенте
Процедура ЗаврешитьВводРазноязычныхТекстов(РезультатВвода, ДополнительныеПараметры) Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаврешитьВводРазноязычныхТекстовНаСервере(РезультатВвода, ДополнительныеПараметры);

	Модифицированность = истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаврешитьВводРазноязычныхТекстовНаСервере(РезультатВвода, ДополнительныеПараметры)
	
	СтрокаТекущая = Объект[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);  
	Для Каждого КлючЗначение из РезультатВвода Цикл
		СтрокаТекущая[ДополнительныеПараметры.ИмяРеквизита+КлючЗначение.Ключ] = КлючЗначение.Значение; 
	КонецЦикла;    
	
	Если ДополнительныеПараметры.ИмяТаблицы = "СтруктураПрофиля" Тогда
		ОбновитьЗаголовокСвязанныхПолей(СтрокаТекущая.СтрокаПоляКомпоновки, СтрокаТекущая.ЗаголовокRU);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьПараметрВГруппу(Команда)

	ВыделенныеСтроки = Элементы.ПоляОбъекта.ВыделенныеСтроки;  
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СписокГрупп = ПолучитьСписокГруппНаСервере();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьПеремещениеВгруппу", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокГрупп.ПоказатьВыборЭлемента(Оповещение, "Выберите группу");
	
КонецПроцедуры      

&НаКлиенте
Процедура ЗавершитьПеремещениеВгруппу(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		СтрокаТекущая = Объект.ПоляОбъекта.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтрокаТекущая.ИдентификаторГруппы = ЭлементСписка.Значение;                  
	КонецЦикла;  
	
	Модифицированность = Истина;
	
	ОбновитьКоличествоПолейГруппНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокГруппНаСервере()
	
	СписокГрупп = Новый СписокЗначений;
	
	Для Каждого СтрокаГрупп из Объект.ГруппыПолей Цикл
		СписокГрупп.Добавить(СтрокаГрупп.ИдентификаторГруппы, СтрокаГрупп.ИмяГруппыRU, , БиблиотекаКартинок.Папка);
	КонецЦикла; 
	
	Возврат СписокГрупп;
	
КонецФункции

&НаКлиенте
Процедура ПоляОбъектаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформление(Команда)
	
	ВыбранныеСтроки = Элементы.ГруппыПолей.ВыделенныеСтроки;  
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  
	
	СтруктураПараметров = Новый Структура(ОформлениеГруппПоУмолчанию);
	ОткрытьФормуНастройкиОформления(СтруктураПараметров, ВыбранныеСтроки);
	
КонецПроцедуры   

&НаКлиенте
Процедура ОткрытьФормуНастройкиОформления(СтруктураПараметров, ВыбранныеСтроки)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбранныеСтроки", ВыбранныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборОформленияГрупп", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаУстановкиОформления", СтруктураПараметров, ЭтаФорма,,,,Оповещение);

КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыборОформленияГрупп(РезультатОформления, ДополнительныеПараметры) Экспорт
	
	Если РезультатОформления = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	ЗавершитьВыборОформленияГруппНаСервере(РезультатОформления, ДополнительныеПараметры);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыборОформленияГруппНаСервере(Знач РезультатОформления,  ДополнительныеПараметры)
	
	Для Каждого ТекущаяСтрока из ДополнительныеПараметры.ВыбранныеСтроки Цикл  
		УстановитьОформлениеСтрокиНаСервере(ТекущаяСтрока, РезультатОформления);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеСтрокиНаСервере(ТекущаяСтрока, Знач РезультатОформления)
	
	СтрокаТекущая = Объект.ГруппыПолей.НайтиПоИдентификатору(ТекущаяСтрока);  
	Если Не ЗначениеЗаполнено(СтрокаТекущая.ИдентификаторГруппы) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТекущая.Шрифт 				= РезультатОформления.Шрифт;
	СтрокаТекущая.ЦветТекста 			= РезультатОформления.ЦветТекста;
	СтрокаТекущая.ЦветФона 				= РезультатОформления.ЦветФона; 
	СтрокаТекущая.ОтображатьЗаголовок	= РезультатОформления.ОтображатьЗаголовок; 
	СтрокаТекущая.ЕстьОформление		= 1;

КонецПроцедуры 


&НаКлиенте
Процедура УстановитьОформлениеПоУмолчанию(Команда)  
	
	ВыбранныеСтроки = Элементы.ГруппыПолей.ВыделенныеСтроки;  
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	УстановитьОформлениеПоУмолчаниюНаСервере(ВыбранныеСтроки);

КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеПоУмолчаниюНаСервере(ВыбранныеСтроки)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбранныеСтроки", ВыбранныеСтроки);   
	
	РезультатОформления = Новый Структура(ОформлениеГруппПоУмолчанию);
	
	ЗавершитьВыборОформленияГруппНаСервере(РезультатОформления, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОформленияПоУмолчанию()
	
	ХранилищеЗначения 	= Константы.CW_ОформлениеГруппВебШаблонов.Получить();
	СтруктураПараметров = ХранилищеЗначения.Получить();
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Шрифт", 				ШрифтыСтиля.ШрифтТекста);
		СтруктураПараметров.Вставить("ЦветТекста", 			ЦветаСтиля.ЦветТекстаПоля);
		СтруктураПараметров.Вставить("ЦветФона", 			ЦветаСтиля.ЦветФонаПоля);
		СтруктураПараметров.Вставить("ОтображатьЗаголовок",	Истина);
	КонецЕсли;   
	
	ОформлениеГруппПоУмолчанию = Новый ФиксированнаяСтруктура(СтруктураПараметров);
	
КонецПроцедуры
